#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rocky-mountain-chile-man/kubernetes-ops-dev-vpc/runs/run-Ajh5ZVvF7zkBd3M7

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05ba0b64b4a4777b4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ad70455cfaf2bcf6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-013bda9b3a87ee037]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-038a6d264d0c056c9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e7e5a6293ad88a14]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-00020b3d153c894ed]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06df9d6ba25fe0a48]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-018809b685a7cc778]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-08018340b49363e5e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-040ffed981d1b11a8]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b2673df680902f10]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ba511d830763c8c1]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-05dd0faa949f0426f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-040ffed981d1b11a81080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0ba511d830763c8c1"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-eu-west-1a" -> "rmcm-vpc-us-west-2a"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "rmcm-vpc-eu-west-1a" -> "rmcm-vpc-us-west-2a"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0b2673df680902f10"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-eu-west-1b" -> "rmcm-vpc-us-west-2"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "rmcm-vpc-eu-west-1b" -> "rmcm-vpc-us-west-2"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-05dd0faa949f0426f"
      ~ tags                 = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-eu-west-1c" -> "rmcm-vpc-us-west-2d"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "rmcm-vpc-eu-west-1c" -> "rmcm-vpc-us-west-2d"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0ba511d830763c8c1"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0b2673df680902f10"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-05dd0faa949f0426f"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2d"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-us-west-2d"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-00020b3d153c894ed"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06df9d6ba25fe0a48"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-08018340b49363e5e"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-00020b3d153c894ed"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-private-eu-west-1a" -> "rmcm-vpc-private-us-west-2a"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "rmcm-vpc-private-eu-west-1a" -> "rmcm-vpc-private-us-west-2a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06df9d6ba25fe0a48"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-private-eu-west-1b" -> "rmcm-vpc-private-us-west-2"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "rmcm-vpc-private-eu-west-1b" -> "rmcm-vpc-private-us-west-2"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-08018340b49363e5e"
      ~ tags             = {
            "Environment" = "dev"
          ~ "Name"        = "rmcm-vpc-private-eu-west-1c" -> "rmcm-vpc-private-us-west-2d"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "rmcm-vpc-private-eu-west-1c" -> "rmcm-vpc-private-us-west-2d"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-00020b3d153c894ed"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-06df9d6ba25fe0a48"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-08018340b49363e5e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-040ffed981d1b11a8"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-040ffed981d1b11a8"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-040ffed981d1b11a8"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2d"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-private-us-west-2d"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2d"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rmcm-vpc-public-us-west-2d"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-05ba0b64b4a4777b4"
    }

Plan: 18 to add, 6 to change, 0 to destroy.


```


</details>

*Pusher: @joel-grant, Action: `pull_request`*